cases/runs/pipe20m__20251125-111607__prueba1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          16000;
        startFace       927600;
    }
    outlet
    {
        type            patch;
        nFaces          16000;
        startFace       943600;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32800;
        startFace       959600;
    }
)

// ************************************************************************* //
